Revit 2015 API
ReinforcementSettings.DocumentContainsNoAreaOrPathReinforcement Method
 Checks whether the document is free of AreaReinforcement and PathReinforcement elements. Only in this case is it permissible to change the HostStructuralRebar property. Only in this case it is allowed to change RebarShapeDefinesHooks property.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2013
Syntax
C#
public bool DocumentContainsNoAreaOrPathReinforcement()
Visual Basic
Public Function DocumentContainsNoAreaOrPathReinforcement As Boolean
Visual C++
public:
bool DocumentContainsNoAreaOrPathReinforcement()
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace